package com.javarush.task.task05.task0528;

/* 
Вывести на экран сегодняшнюю дату
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("26" + " 10"+ " "+ " 2019");
     //   21 02 2014//напишите тут ваш код
    }
}
