package com.javarush.task.task01.task0126;

/* 
Не хочешь  - решай нехотя
*/

public class Solution {
    public static void main(String[] args) {
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" ); 
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" ); 
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" ); 
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" ); 
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя" );//напишите тут ваш код
    }
}
